Revit 2027 API
PlanViewRangeLevel Enumeration
 An enumerated type representing the options for setting the range for a plan view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlanViewRangeLevel
Public Enumeration PlanViewRangeLevel
public enum class PlanViewRangeLevel
type PlanViewRangeLevel
Members
Member name | Value | Description
Above | -2 |  View range is the level above
Below | -4 |  View range is the level below
Current | -3 |  View range is the current level
Unlimited | -1 |  View range is unlimited
Unused | -5
See Also
Reference
Autodesk.Revit.DB Namespace